# XYZPoint Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntersectionResult..::..XYZPoint Property
IntersectionResult Class See Also
---
Point of intersection in local 3d coordinates.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ XYZPoint { get; internal set; }
```

Visual Basic
---
```text
Public Property XYZPoint As XYZ
	Get
	Friend Set
```

Visual C++
---
```text
public:
property XYZ^ XYZPoint {
	XYZ^ get ();
	internal: void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown in the getter when this property has not been set by the method providing the result. |

# See Also
IntersectionResult Class
Autodesk.Revit.DB Namespace